app/controllers/articles_controller.rb

  def index
    @articles = Article.find(:all, :conditions => { :user_id => current_user[:id] })
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = 3

  def create
    @article = Article.new(params[:article])
    @article.user = current_user

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("content", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "wefwefew"], ["created_at", 2014-10-25 03:52:57 UTC], ["title", "wef"], ["updated_at", 2014-10-25 03:52:57 UTC], ["user_id", 1]]

  def destroy
    #@article = Article.find(params[:id])
    #authorize! :destroy, @article
    @article.destroy
---
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 3]]